//
//  DummyString.swift
//  NyamNyam
//
//  Created by 한택환 on 2023/03/09.
//

import Foundation

public let strData = """
{
    "0": {
        "2023.03.09": {
            "0": {
                "생활관식당(블루미르308관)": {
                    "조식(한식)": {
                        "price": "4,500 원",
                        "menu": "쌀밥|새알옹심이들깨탕|매콤닭살볶음|도토리묵*양념장|치커리생채|포기김치"
                    }
                }
            },
            "1": {
                "참슬기식당(310관 B4층)": {
                    "중식(한식)": {
                        "price": "4,000 원",
                        "menu": "토마토파스타|마늘빵|피클"
                    },
                    "중식(특식)": {
                        "price": "5,500 원",
                        "menu": "콩나물국|돈사태김치찜|연두부양념장|청포묵김가루무침|깍두기|황도"
                    }
                },
                "생활관식당(블루미르308관)": {
                    "중식(한식)": {
                        "price": "5,500 원",
                        "menu": "잡곡밥|된장찌개|삼겹살캠핑구이|모듬튀김|야채쌈*쌈장|포기김치|쥬시쿨"
                    }
                },
                "생활관식당(블루미르309관)": {
                    "중식(한식)": {
                        "price": "7,000 원",
                        "menu": "김치찌개|순두부찌개"
                    },
                    "중식(양식)": {
                        "price": "7,000 원",
                        "menu": "오므라이스|수제등심돈까스|고구마치즈돈까스"
                    },
                    "중식(특식)": {
                        "price": "6,000 원",
                        "menu": "씽푸짜장면|씽푸짬뽕|탕수육|탕짜면|탕짬면"
                    }
                }
            },
            "2": {
                "참슬기식당(310관 B4층)": {
                    "석식(학생석식)": {
                        "price": "4,000 원",
                        "menu": "치킨까스|새우까스*타르소스|야채샐러드|단무지|쥬시쿨"
                    },
                    "석식(석식)": {
                        "price": "5,500 원",
                        "menu": "소고기미역국|가자미구이|새우까스*타르소스|참나물무침|양념깻잎지|김치"
                    }
                },
                "생활관식당(블루미르308관)": {
                    "석식(한식)": {
                        "price": "5,500 원",
                        "menu": "<일품>쌀밥|특)나주곰탕|오징어야채초무침|단호박전|깻잎지무침|석박지"
                    }
                },
                "생활관식당(블루미르309관)": {
                    "석식(한식)": {
                        "price": "7,000 원",
                        "menu": "김치찌개|순두부찌개"
                    },
                    "석식(양식)": {
                        "price": "7,000 원",
                        "menu": "오므라이스|수제등심돈까스|고구마치즈돈까스"
                    },
                    "석식(특식)": {
                        "price": "6,000 원",
                        "menu": "씽푸짜장면|씽푸짬뽕|탕수육|탕짜면|탕짬면"
                    }
                }
            }
        },
        "2023.03.10": {
            "0": {
                "참슬기식당(310관 B4층)": {
                    "석식(학생석식)": {
                        "price": "4,000 원",
                        "menu": ""
                    }
                }
            },
            "1": {
                "참슬기식당(310관 B4층)": {
                    "중식(한식)": {
                        "price": "4,000 원",
                        "menu": "바지락순두부찌개|탕수만두|도시락김"
                    },
                    "중식(특식)": {
                        "price": "5,500 원",
                        "menu": "사천짜장덮밥|계란탕|부추잡채*꽃빵|양장피냉채|탕수만두|단무지"
                    }
                },
                "생활관식당(블루미르308관)": {
                    "중식(한식)": {
                        "price": "5,500 원",
                        "menu": "<일품>쌀밥|특)튀김우동|타코야끼|견과류멸치볶음|고춧잎무침|포기김치"
                    }
                },
                "생활관식당(블루미르309관)": {
                    "중식(한식)": {
                        "price": "7,000 원",
                        "menu": "김치찌개|순두부찌개"
                    },
                    "중식(양식)": {
                        "price": "7,000 원",
                        "menu": "오므라이스|수제등심돈까스|고구마치즈돈까스"
                    },
                    "중식(특식)": {
                        "price": "6,000 원",
                        "menu": "씽푸짜장면|씽푸짬뽕|탕수육|탕짜면|탕짬면"
                    }
                }
            },
            "2": {
                "참슬기식당(310관 B4층)": {
                    "": {
                        "price": ""
                    }
                },
                "생활관식당(블루미르308관)": {
                    "": {
                        "price": ""
                    }
                },
                "생활관식당(블루미르309관)": {
                    "석식(한식)": {
                        "price": "7,000 원",
                        "menu": "김치찌개|순두부찌개"
                    },
                    "석식(양식)": {
                        "price": "7,000 원",
                        "menu": "오므라이스|수제등심돈까스|고구마치즈돈까스"
                    },
                    "석식(특식)": {
                        "price": "6,000 원",
                        "menu": "씽푸짜장면|씽푸짬뽕|탕수육|탕짜면|탕짬면"
                    }
                }
            }
        },
        "2023.03.11": {
            "0": {
                "생활관식당(블루미르308관)": {
                    "조식(양식)": {
                        "price": "4,500 원",
                        "menu": "빵3종*잼|시리얼|소시지*머스타드s|샐러드|우유|과일"
                    }
                }
            },
            "1": {
                "생활관식당(블루미르308관)": {
                    "중식(양식)": {
                        "price": "5,500 원",
                        "menu": "쌀밥|야채크림스프|치즈함박스테이크|감자범벅|포기김치|쿨피스|모듬샐러드"
                    }
                },
                "생활관식당(블루미르309관)": {
                    "중식(한식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "중식(양식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "중식(특식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    }
                }
            },
            "2": {
                "생활관식당(블루미르308관)": {
                    "석식(한식)": {
                        "price": "5,500 원",
                        "menu": "잡곡밥|감자수제비|매콤닭갈비|짜장잡채|시금치나물|포기김치|컵주스"
                    }
                },
                "생활관식당(블루미르309관)": {
                    "석식(한식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "석식(양식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "석식(특식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    }
                }
            }
        },
        "2023.03.12": {
            "0": {
                "생활관식당(블루미르308관)": {
                    "석식(한식)": {
                        "price": "5,500 원",
                        "menu": "고추참치볶음밥|미역국|새우까스*타르타르s|산고추절임|포기김치|요구르트|모듬샐러드"
                    }
                },
                "생활관식당(블루미르309관)": {
                    "석식(한식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "석식(양식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "석식(특식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    }
                }
            },
            "1": {
                "생활관식당(블루미르308관)": {
                    "중식(한식)": {
                        "price": "5,500 원",
                        "menu": "쌀밥|호박새우젓국|간장불고기|해물파전|참나물무침|깍두기|모듬샐러드"
                    }
                },
                "생활관식당(블루미르309관)": {
                    "중식(한식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "중식(양식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "중식(특식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    }
                }
            },
            "2": {
                "생활관식당(블루미르308관)": {
                    "석식(한식)": {
                        "price": "5,500 원",
                        "menu": "고추참치볶음밥|미역국|새우까스*타르타르s|산고추절임|포기김치|요구르트|모듬샐러드"
                    }
                },
                "생활관식당(블루미르309관)": {
                    "석식(한식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "석식(양식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    },
                    "석식(특식)": {
                        "price": "0 원",
                        "menu": "주말운영없음"
                    }
                }
            }
        },
        "2023.03.13": {
            "0": {
                "참슬기식당(310관 B4층)": {}
            },
            "1": {
                "참슬기식당(310관 B4층)": {}
            },
            "2": {
                "참슬기식당(310관 B4층)": {}
            }
        },
        "2023.03.14": {
            "0": {
                "참슬기식당(310관 B4층)": {}
            },
            "1": {
                "참슬기식당(310관 B4층)": {}
            },
            "2": {
                "참슬기식당(310관 B4층)": {}
            }
        },
        "2023.03.15": {
            "0": {
                "참슬기식당(310관 B4층)": {}
            },
            "1": {
                "참슬기식당(310관 B4층)": {}
            },
            "2": {
                "참슬기식당(310관 B4층)": {}
            }
        }
    },
    "1": {
        "2023.03.09": {
            "0": {
                "(안성)라면": {
                    "조식": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "1": {
                "카우잇츠(cau eats)": {
                    "중식(특식)": {
                        "price": "5,500 원",
                        "menu": "콩나물국|돈사태김치찜|연두부양념장|청포묵김가루무침|깍두기|황도"
                    },
                    "중식(일품1)": {
                        "price": "4,000 원",
                        "menu": "파스타|마늘빵|피클"
                    }
                },
                "(안성)라면": {
                    "중식(중식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "2": {
                "카우잇츠(cau eats)": {
                    "석식(특식)": {
                        "price": "5,500 원",
                        "menu": "소고기미역국|가자미구이|새우까스*타르소스|참나물무침|깻잎지|김치"
                    },
                    "석식(일품1)": {
                        "price": "4,000 원",
                        "menu": "치킨까스|새우까스*타르소스|야채샐러드|깍두기|쥬시쿨"
                    }
                },
                "(안성)라면": {
                    "석식(석식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            }
        },
        "2023.03.10": {
            "0": {
                "(안성)라면": {
                    "석식(석식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "1": {
                "카우잇츠(cau eats)": {
                    "중식(특식)": {
                        "price": "5,500 원",
                        "menu": "사천짜장덮밥|계란탕|부추잡채*꽃빵|양장피냉채|탕수만두|단무지"
                    },
                    "중식(일품1)": {
                        "price": "4,000 원",
                        "menu": "바지락순두부찌개|탕수만두|도시락김"
                    }
                },
                "(안성)라면": {
                    "중식(중식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "2": {
                "카우잇츠(cau eats)": {
                    "": {
                        "price": ""
                    }
                },
                "(안성)라면": {
                    "": {
                        "price": ""
                    }
                }
            }
        },
        "2023.03.11": {
            "0": {
                "(안성)라면": {
                    "조식": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "1": {
                "(안성)라면": {
                    "조식": {
                        "price": "2,500 원",
                        "menu": ""
                    }
                }
            },
            "2": {
                "(안성)라면": {
                    "중식(중식)": {
                        "price": "2,500 원",
                        "menu": ""
                    }
                }
            }
        },
        "2023.03.12": {
            "0": {
                "(안성)라면": {
                    "조식": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "1": {
                "(안성)라면": {
                    "중식(중식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "2": {
                "(안성)라면": {
                    "석식(석식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            }
        },
        "2023.03.13": {
            "0": {
                "(안성)라면": {
                    "조식": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "1": {
                "카우잇츠(cau eats)": {
                    "중식(특식)": {
                        "price": "5,500 원",
                        "menu": "미역국|쭈꾸미삼겹볶음|감자샐러드|콩나물무침|김치|고구마맛탕"
                    },
                    "중식(일품1)": {
                        "price": "4,000 원",
                        "menu": "마늘쫑돼지고기덮밥|계란후라이|감자고로케*케찹|단무지"
                    }
                },
                "(안성)라면": {
                    "중식(중식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "2": {
                "카우잇츠(cau eats)": {
                    "석식(특식)": {
                        "price": "5,500 원",
                        "menu": "감자탕|연두부양념장|봄동무침|숙주나물|김치"
                    },
                    "석식(일품1)": {
                        "price": "4,000 원",
                        "menu": "라볶이|찐순대|김말이튀김|어묵탕|단무지"
                    }
                },
                "(안성)라면": {
                    "석식(석식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            }
        },
        "2023.03.14": {
            "0": {
                "(안성)라면": {
                    "조식": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "1": {
                "카우잇츠(cau eats)": {
                    "중식(특식)": {
                        "price": "5,500 원",
                        "menu": "북어국|오삼떡볶이|핫도그*케찹|꼬시래기무침|깍두기"
                    },
                    "중식(일품1)": {
                        "price": "4,000 원",
                        "menu": "돼지고기김치찌개|핫도그*케찹|콩나물무침"
                    }
                },
                "(안성)라면": {
                    "중식(중식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "2": {
                "카우잇츠(cau eats)": {
                    "석식(특식)": {
                        "price": "5,500 원",
                        "menu": "배추된장국|고추장오리불고기|시금치나물|도시락김|요플레|깍두기"
                    },
                    "석식(일품1)": {
                        "price": "4,000 원",
                        "menu": "카레라이스|그릴소시지|깍두기|가쓰오국"
                    }
                },
                "(안성)라면": {
                    "석식(석식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            }
        },
        "2023.03.15": {
            "0": {
                "(안성)라면": {
                    "조식": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "1": {
                "(안성)라면": {
                    "중식(중식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            },
            "2": {
                "카우잇츠(cau eats)": {
                    "석식(특식)": {
                        "price": "5,500 원",
                        "menu": "수제비국|고등어무조림|동그랑땡전|상추겉절이|깍두기|오렌지주스"
                    },
                    "석식(일품1)": {
                        "price": "4,500 원",
                        "menu": "치즈돈까스|야채샐러드|단무지|오렌지주스"
                    }
                },
                "(안성)라면": {
                    "석식(석식)": {
                        "price": "2,500 원",
                        "menu": "<운영시간>6:00~23:00|신라면|너구리|진라면|틈새라면"
                    }
                }
            }
        }
    }
}

"""

